# ; 2) შედით რესურსებში და დღეს რაც დავწერეთ ყველაფერი ისწავლეთ კარგად, მათ შორის ახალი ინგლისური სიტყვებიც
# ; 3) ამ ფოტოში გაარკვიეთ მეოთხე print'ის შედეგი რატომ გამოიტანა float და არა int
# ; 4) დაადეკლარირეთ 10 ცვლადი და ყველა ცვლადს მიეცით განსხვავებული სახელი და მნიშვნელობა, რომლებიც აუცილებლად უნდა შეესაბამებოდეს
# ; 5) მოიძიეთ მათემატიკური ოპერაციები პითონში, დასერჩეთ: mathematical operations in python და რასაც ისწავლით გატესტეთ


print(10 / 2)
print("იმიტომ წერს 5.0 და არა 5 რომ როდესაც ერთმანეთზე ვყოფთ int კეთდება float ად")


კონტინენტი = "აფრიკა"
print(კონტინენტი)

ცხოველი = "მგელი"
print(ცხოველი)

ფრინველი = "არწივი"
print(ფრინველი)

თევზი = "მერცხალი"
print(თევზი)

კომპანია = "ტოიოტა"
print(კომპანია)

ხილი = "ვაშლი"
print(ხილი)

ბოსტნეული = "კიტრი"
print(ბოსტნეული)

პლანეტა = "დედამიწა"
print(პლანეტა)

გალაქტიკა = "ირმის ნახტომი"
print(გალაქტიკა)

ფერი = "წითელი"
print(ფერი)

