# ყველა დავალებაში გამოიყენეთ map ან filter.
# 1) შექმენით რაიმე list'ი რომელშიც იქნება integer'ები და შემდეგ ამოწერეთ მხოლოდ ისეთი რიცხვები რომლებიც მეტია ან ტოლია 40'ის.

list1 = [ 10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
big = list(filter(lambda x: x >= 40, list1))
print(big)

# 2) შექმენით რაიმე list'ი რომელშიც იქნება integer'ები და შემდეგ გამოიტანეთ list'ი სადაც იქნება ყველა რიცხვის კვადრატი.

list2 = [ 1, 2, 3, 4, 5,]
kvadrati = list(map(lambda x: x ** 2, list2))
print(kvadrati)

# 3) შექმენით რაიმე list'ი რომელშიც იქნება string'ები და შემდეგ ამოწერეთ მხოლოდ ისეთები რომლებიც მთავრდება "a" სიმბოლოთი.


