# კითხვებზე პასუხი (კომენტარებით):
# 1) რომლებია mutable მონაცემთა ტიპები?
# 2) რომლებია immutable მონაცემთა ტიპები?
# 3) რა ეწოდება lambda ფუნქციას მეორენაირად?
# 4) რა განსხვავებაა map'სა და filter'ს შორის?
# 5) რა ჰქვია ორი სტრინგის შეერთებას?

#1 dictionary set და  list
#2 int float tuple str
#3 anonymous/ანონიმური
#4 filter ფუნქცია აბრუნებს მხოლოდ trues, და არა falses.
#5 კონკატენაცია

# MAPS
# გამოიყენეთ map ფუნქცია რომ შექმნათ list'ი სადაც იქნება ამ რიცხვების კვადრატები: [1, 2, 3, 4, 5]
numbers = [1, 2, 3, 4, 5]

squared_numbers = list(map(lambda x: x * x, numbers))
print(squared_numbers)
# დაწერეთ პროგრამა mapის გამოყენებით რომ გადაიყვანოთ ამ list'ში მოცემული celsius'ები fahrenheit'ში: [0, 20, 30, 40] (1 celsius == 33.8 fahrenheit)

# გამოიყენეთ map ფუნქცია რომ გაადიდოთ ყველა სიტყვის პირველი ასო ამ list'ში: ["hello", "world", "python"].

# FILTERS

# გამოიყენეთ filter ფუნქცია რომ ამოწეროთ მხოლოდ ლუწი რიცხვები list'იდან: [1, 2, 3, 4, 5, 6, 7, 8].

# დაწერეთ პროგრამა filterის გამოყენებით რომ ამოწეროთ ისეთი string'ები რომლებიც შეიცავენ 4 სიმბოლოს ან მასზე მეტს: ["cat", "house", "tree", "car"].

# გამოიყენეთ filter ფუნქცია რომ ამოწეროთ სამის ჯერადი რიცხვები: [3, 9, 15, 22, 27, 30].
