# 2) შექმენით ცვლადი რომელსაც მნიშვნელობად მისცემთ lambda ფუნქციას რომელიც აბრუნებს 2 სტრინგის ჯამს

concat_strings = lambda s1, s2: s1 + s2


# 3) შექმენით ცვლადი რომელსაც მნიშვნელობად მისცემთ lambda ფუნქციას რომელიც აბრუნებს 3 რიცხვის ჯამს
sum_three_numbers = lambda a, b, c: a + b + c

# 4) შექმენით ცვლადი რომელსაც მნიშვნელობად მისცემთ lambda ფუნქციას რომელიც არგუმენტად იღებს list'ს და აბრუნებს მასში მყოფი რიცხვების ჯამს

sum_list = lambda lst: sum(lst)

# 5) შექმენით ცვლადი რომელსაც მნიშვნელობად მისცემთ lambda ფუნქციას რომელიც არგუმენტად იღებს string'ს და რაიმე სიმბოლოს და აბრუნებს რამდენჯერ მეორდება სიმბოლო string'ში

count_symbol = lambda s, symbol: s.count(symbol)

# 6) გააკეთეთ ნებისმიერი 5 ცალი 8 kyu
